In [33]:
import pandas as pd
banco = pd.read_excel(r'C:\Users\Gabriel\Desktop\Programação\Requisicao_combustivel\banco_de_dados.xlsx')
banco.head()

,ID,Solicitante,Motorista,Categoria,Quantidade,Preço Unitário,Total,Data,Observação
0,1,Adilson,Gabriel,Etanol,NaN,NaN,0,02/12/2022,NaN
1,2,Adilson,Adilson,Filtro de óleo,NaN,NaN,0,02/12/2022,NaN
2,3,Gabriel,Adilson,Gasolina,NaN,NaN,0,02/12/2022,NaN
3,4,Gabriel,Gemerson,Gasolina,NaN,NaN,0,02/12/2022,ultima

In [34]:
novo_valor = banco.query('ID == 3').replace([3,'Gabriel','Adilson','Filtro de óleo', '', '', 0, '02/12/2022', ''], [3,'Gabriel', 'Gabriel','Etanol', 0,0,0,'30/11/2022','replace'])

In [35]:
valor_antigo = banco.query('ID == 3')

In [36]:
banco.query('ID == 3')

,ID,Solicitante,Motorista,Categoria,Quantidade,Preço Unitário,Total,Data,Observação
2,3,Gabriel,Adilson,Gasolina,NaN,NaN,0,02/12/2022,NaN

In [37]:
banco.iloc[2].replace([3,'Gabriel','Adilson','Filtro de óleo', '', '', 0, '02/12/2022', ''], [3,'Gabriel', 'Gabriel','Etanol', 0,0,0,'30/11/2022','replace'], inplace=True)

C:\Users\Gabriel\AppData\Local\Temp\ipykernel_3896\1620624196.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  banco.iloc[2].replace([3,'Gabriel','Adilson','Filtro de óleo', '', '', 0, '02/12/2022', ''], [3,'Gabriel', 'Gabriel','Etanol', 0,0,0,'30/11/2022','replace'], inplace=True)

In [38]:
banco

,ID,Solicitante,Motorista,Categoria,Quantidade,Preço Unitário,Total,Data,Observação
0,1,Adilson,Gabriel,Etanol,NaN,NaN,0,02/12/2022,NaN
1,2,Adilson,Adilson,Filtro de óleo,NaN,NaN,0,02/12/2022,NaN
2,3,Gabriel,Adilson,Gasolina,NaN,NaN,0,02/12/2022,NaN
3,4,Gabriel,Gemerson,Gasolina,NaN,NaN,0,02/12/2022,ultima

In [39]:
cond = banco['ID'] == 3
cond

0    False
1    False
2     True
3    False
Name: ID, dtype: bool

In [40]:
banco.loc[cond, 'Quantidade'] = 100
banco.loc[cond, 'Preço Unitário'] = 30

In [41]:
banco

,ID,Solicitante,Motorista,Categoria,Quantidade,Preço Unitário,Total,Data,Observação
0,1,Adilson,Gabriel,Etanol,NaN,NaN,0,02/12/2022,NaN
1,2,Adilson,Adilson,Filtro de óleo,NaN,NaN,0,02/12/2022,NaN
2,3,Gabriel,Adilson,Gasolina,100.0,30.0,0,02/12/2022,NaN
3,4,Gabriel,Gemerson,Gasolina,NaN,NaN,0,02/12/2022,ultima

In [ ]:
banco.to_excel("banco_de_dados.xlsx", index=False)